Revit 2026 API
CorrectionFactor Class
Note: This API is now obsolete.
 Represents electrical correction factor information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.CorrectionFactor
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
[ObsoleteAttribute("CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")]
public class CorrectionFactor : APIObject
<ObsoleteAttribute("CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")>
Public Class CorrectionFactor
	Inherits APIObject
[ObsoleteAttribute(L"CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")]
public ref class CorrectionFactor : public APIObject
[<ObsoleteAttribute("CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")>]
type CorrectionFactor =
    class
        inherit APIObject
    end
The CorrectionFactor type exposes the following members.
Properties
Name | Description
Factor |  Get factor value of wire correction factor.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTemperature |  Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
Correction factor is defined based on corresponding wire material type and temperature rating type.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace